
#include <stdio.h>
#include <string.h>
//大端字节序：把数据的低位字节序的内容放在高地址处，高位字节序的内容放在低地址处
//小端字节序：把数据的低位字节序的内容放在低地址处，高位字节序的内容放在高地址处


//判断大端小端
int main_1()
{
	int a = 1;
	char* p = &a;
	if (*p == 1)
	{
		printf("小端");
	}
	else if(*p == 0)
	{
		printf("大端");
	}
	return 0;
}


int main_2()
{
	char a = -128;
	//10000000000000000000000010000000
	//11111111111111111111111101111111
	//11111111111111111111111110000000
	//100000000
	printf("%u", a);
	//整型提升
	//11111111111111111111111110000000
	//%u认为第一个1不再代表符号位
	//输出4294967168（= 2^32 - 2^7 = 2^31+2^30+…+2^7）
	return 0;
}


int main_3()
{
	unsigned int i;
	for (i = 9; i >= 0; i--)
	{
		printf("%u\n", i);
	}
	//死循环
	
	return 0;
}


int main_4()
{
	char a[1000];
	for (int i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d", strlen(a));
	//结果是255
	//-1 -2 … -127 -128 127 126 … 3 2 1 0 -1 -2 …//char类型范围127 ~ -128
	//strlen计算字符串长度要一直读到\0，也就是0，则字符串长度为128+127=255
	return 0;
}


int main_5()
{
	int n = 9;
	float* pn = (float*)&n;
	printf("%d\n", n);
	printf("%f\n", *pn);
	*pn = 9.0;
	printf("%d\n", n);
	printf("%f\n", *pn);
	return 0;
}

int main_6()
{
	float f = 5.5;
	//二进制 101.1//十分位表示2^-1
	//浮点数储存方式 (-1)^s * M * 2^E
	//s为0时为正数，为1时为负数；M为大于等于1小于2的数，E为移动位数+127（double的话+1023）
	//对float，s有1个比特位，E有8个比特位，M有23个比特位（M只存小数点后的）
	//此时s=0，M=1.011，E=2+127=129
	//所以存储为 0 10000001 0110000000000000000000
	//四字节 0100 0000 1011 0000 0000 0000 0000 0000
	//十六进制 40 b0 00 00
	return 0;
}

int main()
{
	char* p = "abcdefg";//"abcdefg"为常量字符串
	char* q = "abcdefg";//p,q都是‘a’的地址
	const char* c = "sa";//加const更好
	return 0;
}