#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

int main_1()
{
	int a = 3;
	int b = 5;
	int c = a & b;//& 按位与，二进制都为0（1），则为0（1），其中一个为0，则为0
	//a 3 000000000000000000000011
	//b 5 000000000000000000000101
	//c   000000000000000000000001 1
	int d = a | b;//| 按位或，二进制其中至少一个为1，则为一
	//a 3 000000000000000000000011
	//b 5 000000000000000000000101
	//d   000000000000000000000111 7
	int e = a ^ b;//^ 按位异或，二进制相同，则为0，不同，则为1
	//a 3 000000000000000000000011
	//b 5 000000000000000000000101
	//e   000000000000000000000110 6
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;//实现两个数的交换
	//a ^ a = 0
	//0 ^ a = a
}

int main_2()
{
	//判断一个数字的二进制有多少个1
	int a = 0;
	scanf("%d", &a);
	int b = 1;
	int c = 0;
	int e = 0;
	for (c = 0; c < 32; c++)
	{
		int d = 0;
		d = a & b;
		if (d == 1)
		{
			e++;
		}
		a = a >> 1;
	}
	printf("%d", e);
	return 0;
}


//整型提升时按照符号位进行提升
//char a = -1
//char只有1字节，所以是 11111111（补码）
//整型提升后 11111111111111111111111111111111
//char b = 1
//00000001
//整型提升后 00000000000000000000000000000001

int main()
{
	char a = 3;
	char b = 127;
	char c = a + b;
	printf("%d", c);//结果是-126
	//char a,00000011
	//char b,01111111
	//整型提升，a,00000000000000000000000000000011
	//         b,00000000000000000000000001111111
	//计算     c,00000000000000000000000010000010
	//char c,10000010
	//%d打印的是整型，再次整型提升
	//c,11111111111111111111111110000010(补码)
	//c,10000000000000000000000001111101(反码)
	//c,10000000000000000000000001111110(原码)
	//打印原码，所以是-126
	return 0;
}